[
  {
    "userid": "user1",
    "createtime": "2024-03-01 18:06:25",
    "stockcode": "AAPL",
    "details": [
      {
        "url": "https://www.marketwatch.com/articles/google-ai-chatbots-search-alphabet-stock-a946f999?mod=mw_quote_news",
        "stockcode": "AAPL",
        "content": "Google is one of the best businesses ever built. The \n        Alphabet\n       unit controls more than 90% of the global internet search market, which allows the company to sell an astonishing amount of advertising, $238 billion worth in 2023 alone. But the market now fears it could all come unglued by a torrent of new competition from artificial intelligence.To be sure, it hasn’t happened yet. By one estimate, Google still accounts for 39% of the global ad market. Alphabet is the fifth-largest U.S.-listed company by market value, at $1.7 trillion, trailing only \n        Microsoft,\nApple,\nNvidia,\n       and \n        Amazon.com.\nLong-term investors, meanwhile, have been more than rewarded. Had you invested $1,000 in Google shares at the August 2004 initial public offering, you’d have more than $55,000 today.But the Alphabet story is finally showing cracks. At a recent $138, shares are flat this year, trailing the 8% gain for the Nasdaq Composite and the 42% rise for digital-advertising rival \n        Meta Platforms.\n       Alphabet trades at about a market multiple, with the lowest forward price-to-earnings among the Magnificent Seven. The issue? Google’s search business, once an unassailable iron fortress, now looks vulnerable. And for that you can thank AI, a technology in which Google, ironically, plays a leading role. The emergence over the past 15 months of generative AI chatbots like OpenAI’s ChatGPT, Anthropic’s Claude, and Google’s own Gemini (nee Bard) have created new ways for consumers to find data. That’s not to suggest the bots will squash Google the way Google crushed Alta Vista, Excite, and AskJeeves. But Google’s search domination now seems less certain, and that’s creating at least three big issues for Google—not counting Uncle Sam’s push to declare the company an unfair monopolist:Searchers have choices: The market briefly turned on Alphabet in early 2023 after Microsoft announced plans to use OpenAI’s GPT software to create a new, chatty version of Bing, its 15-year-old search engine that never got much traction. Bing is the clear No. 2 player in search, but it only has 3% market share. Google responded to the threat of a revived Bing with the launch of its own chatbot—what’s now Gemini—and added a generative AI feature to the standard Google search engine. The result is that the Bing threat seems at least temporarily defanged.But Google now faces the prospect of an eternal game of chatbot Whac-A-Mole. Here in Silicon Valley, for instance, people can’t stop talking about an AI-powered search engine called Perplexity, which my colleague Tae Kim wrote about earlier this year. Funded by Nvidia, Jeff Bezos, Databricks, \n        Shopify\n       CEO Tobi Lütke, and other tech luminaries, Perplexity has a clean search interface, with an option to pay $20 a month for a supercharged ChatGPT-style natural language experience. Chatbots aren’t a perfect replacement for Google searches. ChatGPT and Claude were both trained on data sets that ended in 2022—they lack information about real-time events. They can’t tell you who won the Sixers game or what the weekend weather will be. But that could change—Gemini has current news and sports data—and the utility of chatbots is high enough to replace search for many tasks. It now seems likely that Google is going to lose some query share at the margin. And it’s possible the losses will be material.The enemy within: Maybe the greatest enemy to Google search comes from the company itself. As consumers shift more searches to Gemini, the pressure will grow on the company to replace lost search ad revenue. The answer could be to add transactional capabilities to Gemini and to take a cut of the resultant purchases. CEO Sundar Pichai has said ads will remain a key part of the search experience while the company experiments with new ad formats inside generative AI searches.It’s also possible that Google could get traction with its $20-a-month subscription version of Gemini, which provides access to its most advanced AI model. Still, there is a risk that monetizing chatbots will be more difficult than selling ads against search queries. AI is expensive: Some analysts have estimated that the cost per query for an AI chatbot can be as much as 10 times the cost of a conventional Google search. No doubt those costs will decline over time as volumes increase, but any delta between the two puts more pressure on Alphabet’s margins and amplifies the need for Google to monetize Gemini. Meanwhile, the company has said it will ratchet up capital spending substantially in 2024 as it invests in GPUs, servers, and related infrastructure to handle AI work. For all the worries, not a single Wall Street analyst calls Alphabet stock a Sell. Of the 66 sell-side analysts who follow Alphabet, roughly 80% still have Buy ratings, according to FactSet. There is growing skepticism, though, especially among those 20% of analysts that rate shares at Hold or the equivalent. Alphabet shares fell this past week after a bearish note from Melius Research analyst Ben Reitzes. “While Google may have a moat, let us remind you that search isn’t really recurring,” wrote Reitzes, who rates Alphabet at Hold with a $164 price target. “What has been recurring for decades is the reliability of Google’s interface for ad buyers, its reputation for search quality, and its strong brand. But search is not like a subscription to Microsoft 365, Apple Services, or Amazon Prime.” In short, you can switch to another search engine anytime. And your choices are getting better every day.Write to Eric J. Savitz at eric.savitz@barrons.com"
      },
      {
        "url": "https://www.marketwatch.com/story/amid-streamflation-consumers-are-spending-more-on-tv-streaming-than-ever-332bf827?mod=mw_quote_news",
        "stockcode": "AAPL",
        "content": "“Streamflation” has been a hot topic with streaming subscribers recently amid a slew of price hikes by media companies like Walt Disney Co., which raised the price of its Disney+ and Hulu streaming services yet again in August.Yet escalating prices don’t seem to be scaring away consumers; in fact, they’re subscribing, and spending, more than ever. Spending on streaming services in January 2024 spiked more than 70% from 2021, while the share of households paying over $100 a month has more than doubled, according to a new Bank of America report.Conversely, the share of households spending less than $20 dropped by 16% over the same time period.“Millennials and Gen Xers are paying more per household on streaming as they are paying for multiple streaming subscriptions,” the report said. “These cohorts have also seen the largest share increases of those streaming over the past three years.”The ongoing appeal of streaming services from the likes of Disney \n        DIS,\n        +0.33%,\n       Netflix Inc. \n        NFLX,\n        +2.72%,\n       Amazon.com Inc. \n        AMZN,\n        +0.83%,\n       Comcast Corp. \n        CMCSA,\n        -0.12%,\n       Apple Inc. \n        AAPL,\n        -0.60%,\n       Warner Bros. Discovery Inc. \n        WBD,\n        -1.37%\n       and others belies price increases in the U.S. by at least seven major streaming services over the last year. Indeed, the average cost of watching a major ad-free streaming service has risen nearly 25% in about a year, according to a Wall Street Journal analysis.The steady stream of price increases underscore the latest phase in the streaming wars, analysts say, after years of the combatants offering low-cost packages in the pursuit of gaining customers.But after absorbing billions of dollars in losses, the major streaming services are now hiking prices and cracking down on password sharing in the pursuit of profits.“It’s an acceleration of the shift away from traditional TV viewing via cable and satellite. As consumers we may not like paying for it, but the growth will continue because we are following high-quality video content, which is now predominantly distributed through streaming apps,” Jacqueline Corbelli, chief executive of BrightLine Partners, said in an email.“Ad-supported bundles lower the access cost and feeds the flow, ironically,” she added.Mark Vena, CEO and principal analyst at SmartTech Research, said he isn’t sure American consumers are willing to fork over more than $100 a month on streaming content for an extended period of time.“Given the crowded nature of the streaming content space and continued inflation concerns, my guess is where we’re going to see even more consolidation space, potentially resulting in many of the big players offering more bundles,” Vena said in an email."
      },
      {
        "url": "https://www.marketwatch.com/articles/apple-stock-bull-market-down-fomo-ca9ae69f?mod=mw_quote_news",
        "stockcode": "AAPL",
        "content": "The stock market just doesn’t want to go down right now, but no one should let their fear of missing out on gains override their risk management. Nothing looks like it can stop the market. The \n        Nasdaq Composite\n       is on pace to close at a new all-time high, up 1.6% for the week, while the \n        S&P 500\n       is on pace to close the week up 0.8%, which would also be a record. The benchmark index has now risen for two consecutive weeks. We know what investors are thinking. The gains can keep coming, driven by an economy that is neither too hot nor too cold. The personal consumption expenditures price index rose 2.4% year over year in January, in line with estimates, and durable-goods orders came in lower than expected. The economy is growing, but only moderately, and the Federal Reserve can keep thinking about when it can start cutting interest rates. The federal-funds futures market is indicating that the Fed’s most likely course of action this year will be to cut rates three times.This dynamic is why nobody wants to miss out on the rally—and why they think it can keep going. A recent survey from Investors Intelligence shows the number of bulls outnumbered their bearish counterparts by the widest margin since late 2021. This level of bullishness is nearly as good as it gets, and suggests that parts of the market “look a little euphoric,” says Julia Hermann, global market strategist at New York Life Investments. Two risks loom large, though. Despite the fact that the Fed has been reluctant to cut interest rates, the Bloomberg U.S. Financial Conditions Index, which tracks how easy or difficult it is to borrow money, is near its easiest level since late 2021. Conditions haven’t been looser than now in at least the past seven years, according to Evercore ISI strategist Julian Emanuel. That means they’re likely to tighten from here, and when financial conditions tighten, the S&P 500 usually drops. The other, more proximate risk, is what’s happening to \n        Apple.\n       Despite the stock market’s gains this year, Apple has dropped 7.5% and now trades below $180, a level that had been important support for the stock. With iPhone sales growth almost nonexistent in the fourth quarter, the stock could head even lower. If it breaks below $170, the stock could drop even more—and drag the S&P 500 down with it, ending the “fear of missing out” once and for all, Emanuel says.That’s not the kind of market worth chasing. Rather than being afraid of missing out, investors should fear the very real possibility of a decline.Write to Jacob Sonenshine at jacob.sonenshine@barrons.com"
      }
    ]
  },
  {
    "userid": "user2",
    "createtime": "2024-03-01 21:01:42",
    "stockcode": "MSFT",
    "details": [
      {
        "url": "https://www.marketwatch.com/articles/google-ai-chatbots-search-alphabet-stock-a946f999?mod=mw_quote_news",
        "stockcode": "MSFT",
        "content": "Google is one of the best businesses ever built. The \n        Alphabet\n       unit controls more than 90% of the global internet search market, which allows the company to sell an astonishing amount of advertising, $238 billion worth in 2023 alone. But the market now fears it could all come unglued by a torrent of new competition from artificial intelligence.To be sure, it hasn’t happened yet. By one estimate, Google still accounts for 39% of the global ad market. Alphabet is the fifth-largest U.S.-listed company by market value, at $1.7 trillion, trailing only \n        Microsoft,\nApple,\nNvidia,\n       and \n        Amazon.com.\nLong-term investors, meanwhile, have been more than rewarded. Had you invested $1,000 in Google shares at the August 2004 initial public offering, you’d have more than $55,000 today.But the Alphabet story is finally showing cracks. At a recent $138, shares are flat this year, trailing the 8% gain for the Nasdaq Composite and the 42% rise for digital-advertising rival \n        Meta Platforms.\n       Alphabet trades at about a market multiple, with the lowest forward price-to-earnings among the Magnificent Seven. The issue? Google’s search business, once an unassailable iron fortress, now looks vulnerable. And for that you can thank AI, a technology in which Google, ironically, plays a leading role. The emergence over the past 15 months of generative AI chatbots like OpenAI’s ChatGPT, Anthropic’s Claude, and Google’s own Gemini (nee Bard) have created new ways for consumers to find data. That’s not to suggest the bots will squash Google the way Google crushed Alta Vista, Excite, and AskJeeves. But Google’s search domination now seems less certain, and that’s creating at least three big issues for Google—not counting Uncle Sam’s push to declare the company an unfair monopolist:Searchers have choices: The market briefly turned on Alphabet in early 2023 after Microsoft announced plans to use OpenAI’s GPT software to create a new, chatty version of Bing, its 15-year-old search engine that never got much traction. Bing is the clear No. 2 player in search, but it only has 3% market share. Google responded to the threat of a revived Bing with the launch of its own chatbot—what’s now Gemini—and added a generative AI feature to the standard Google search engine. The result is that the Bing threat seems at least temporarily defanged.But Google now faces the prospect of an eternal game of chatbot Whac-A-Mole. Here in Silicon Valley, for instance, people can’t stop talking about an AI-powered search engine called Perplexity, which my colleague Tae Kim wrote about earlier this year. Funded by Nvidia, Jeff Bezos, Databricks, \n        Shopify\n       CEO Tobi Lütke, and other tech luminaries, Perplexity has a clean search interface, with an option to pay $20 a month for a supercharged ChatGPT-style natural language experience. Chatbots aren’t a perfect replacement for Google searches. ChatGPT and Claude were both trained on data sets that ended in 2022—they lack information about real-time events. They can’t tell you who won the Sixers game or what the weekend weather will be. But that could change—Gemini has current news and sports data—and the utility of chatbots is high enough to replace search for many tasks. It now seems likely that Google is going to lose some query share at the margin. And it’s possible the losses will be material.The enemy within: Maybe the greatest enemy to Google search comes from the company itself. As consumers shift more searches to Gemini, the pressure will grow on the company to replace lost search ad revenue. The answer could be to add transactional capabilities to Gemini and to take a cut of the resultant purchases. CEO Sundar Pichai has said ads will remain a key part of the search experience while the company experiments with new ad formats inside generative AI searches.It’s also possible that Google could get traction with its $20-a-month subscription version of Gemini, which provides access to its most advanced AI model. Still, there is a risk that monetizing chatbots will be more difficult than selling ads against search queries. AI is expensive: Some analysts have estimated that the cost per query for an AI chatbot can be as much as 10 times the cost of a conventional Google search. No doubt those costs will decline over time as volumes increase, but any delta between the two puts more pressure on Alphabet’s margins and amplifies the need for Google to monetize Gemini. Meanwhile, the company has said it will ratchet up capital spending substantially in 2024 as it invests in GPUs, servers, and related infrastructure to handle AI work. For all the worries, not a single Wall Street analyst calls Alphabet stock a Sell. Of the 66 sell-side analysts who follow Alphabet, roughly 80% still have Buy ratings, according to FactSet. There is growing skepticism, though, especially among those 20% of analysts that rate shares at Hold or the equivalent. Alphabet shares fell this past week after a bearish note from Melius Research analyst Ben Reitzes. “While Google may have a moat, let us remind you that search isn’t really recurring,” wrote Reitzes, who rates Alphabet at Hold with a $164 price target. “What has been recurring for decades is the reliability of Google’s interface for ad buyers, its reputation for search quality, and its strong brand. But search is not like a subscription to Microsoft 365, Apple Services, or Amazon Prime.” In short, you can switch to another search engine anytime. And your choices are getting better every day.Write to Eric J. Savitz at eric.savitz@barrons.com"
      },
      {
        "url": "https://www.marketwatch.com/story/microsoft-hasnt-been-worth-this-much-more-than-apple-since-2003-8c2583e0?mod=mw_quote_news",
        "stockcode": "MSFT",
        "content": "Microsoft Corp. continues to pull away from Apple Inc. in terms of market capitalization — so much so that the gap between them is the widest it’s been in over two decades. Based on intraday action, Microsoft \n        MSFT,\n        +0.45%\n       has a $3.063 trillion market cap Friday, while Apple’s \n        AAPL,\n        -0.60%\n       clocks in at $2.754 trillion. If the corresponding stock-market action carries through to the close, that would translate to a $309.4 billion margin, the largest between these two companies since Oct. 21, 2003, according to Dow Jones Market Data. Of course, the picture was much different back in 2003, when the $312.1 billion spread between the two tech players was almost as large as Microsoft’s entire valuation. Microsoft commanded a $320.2 billion market value on Oct. 21, 2003, while Apple’s valuation was only $8.1 billion. See also: Microsoft earnings may have offered a big bullish clue about cloud growthFor context about Apple’s business at the time, its annual filing for 2003 discussed “advanced new digital devices such as the company’s iPod digital music players, personal digital assistants, cellular phones, digital still and movie cameras, CD and DVD players, and other electronic devices.”Apple’s business is of course much more advanced now, but investors haven’t been too excited about it this year, with the stock off about 8% so far in 2024. The company returned to year-over-year revenue growth in its latest quarter after four quarters of declines but suggested revenue could fall again in the ongoing quarter. Some on Wall Street have questioned whether Apple’s innovative ways are waning.The market-cap gap between Apple and Microsoft is especially staggering considering how far ahead Apple was just under a year and a half ago. Apple was worth $719.2 billion more than Microsoft on Oct. 28, 2022, according to Dow Jones Market Data.The decline in Apple shares to start 2024 comes after the stock surged 48% in 2023. Microsoft, on the other hand, has been able to sustain its momentum from last year: Its stock advanced 57% then but is up another 10% so far this year. Microsoft, in the eyes of Wall Street, appears a play on the hot artificial-intelligence market, as the company’s Azure cloud-computing business benefits from growing customer interest in AI workloads. At the same time, Microsoft has been infusing its own software products with AI functions, and the company has invested in OpenAI. Apple has long used AI across its business, including for features like the Siri voice assistant and the iPhone’s photo-recognition capabilities. But the company’s management has kept AI discussion to a minimum on recent earnings calls even as corporate executives elsewhere have rushed to convince Wall Street that they’re plays on the trend. See more (from August 2023): Apple’s Tim Cook explains why he won’t showboat around AI“Our M.O., if you will, has always been to do work and then talk about work and not to get out in front of ourselves,” Chief Executive Tim Cook said on the company’s last earnings call. But he added that Apple had some “things” going on with generative AI “that we’re incredibly excited about that we’ll be talking about later this year.”Opinion: Will Apple create a better AI? Questions abound as Tim Cook hints at what’s to come.Goldman Sachs removed Apple shares from its conviction list Friday, while keeping a buy rating on them. Analyst Mike Ng “continues to believe that the market’s focus on slower product revenue growth masks the strength of the Apple ecosystem and associated revenue durability & visibility,” according to Goldman’s report on the changes to the list."
      }
    ]
  },
  {
    "userid": "user2",
    "createtime": "2024-03-01 21:08:15",
    "stockcode": "MSFT",
    "details": [
      {
        "url": "https://www.marketwatch.com/articles/google-ai-chatbots-search-alphabet-stock-a946f999?mod=mw_quote_news",
        "stockcode": "MSFT",
        "content": "Google is one of the best businesses ever built. The \n        Alphabet\n       unit controls more than 90% of the global internet search market, which allows the company to sell an astonishing amount of advertising, $238 billion worth in 2023 alone. But the market now fears it could all come unglued by a torrent of new competition from artificial intelligence.To be sure, it hasn’t happened yet. By one estimate, Google still accounts for 39% of the global ad market. Alphabet is the fifth-largest U.S.-listed company by market value, at $1.7 trillion, trailing only \n        Microsoft,\nApple,\nNvidia,\n       and \n        Amazon.com.\nLong-term investors, meanwhile, have been more than rewarded. Had you invested $1,000 in Google shares at the August 2004 initial public offering, you’d have more than $55,000 today.But the Alphabet story is finally showing cracks. At a recent $138, shares are flat this year, trailing the 8% gain for the Nasdaq Composite and the 42% rise for digital-advertising rival \n        Meta Platforms.\n       Alphabet trades at about a market multiple, with the lowest forward price-to-earnings among the Magnificent Seven. The issue? Google’s search business, once an unassailable iron fortress, now looks vulnerable. And for that you can thank AI, a technology in which Google, ironically, plays a leading role. The emergence over the past 15 months of generative AI chatbots like OpenAI’s ChatGPT, Anthropic’s Claude, and Google’s own Gemini (nee Bard) have created new ways for consumers to find data. That’s not to suggest the bots will squash Google the way Google crushed Alta Vista, Excite, and AskJeeves. But Google’s search domination now seems less certain, and that’s creating at least three big issues for Google—not counting Uncle Sam’s push to declare the company an unfair monopolist:Searchers have choices: The market briefly turned on Alphabet in early 2023 after Microsoft announced plans to use OpenAI’s GPT software to create a new, chatty version of Bing, its 15-year-old search engine that never got much traction. Bing is the clear No. 2 player in search, but it only has 3% market share. Google responded to the threat of a revived Bing with the launch of its own chatbot—what’s now Gemini—and added a generative AI feature to the standard Google search engine. The result is that the Bing threat seems at least temporarily defanged.But Google now faces the prospect of an eternal game of chatbot Whac-A-Mole. Here in Silicon Valley, for instance, people can’t stop talking about an AI-powered search engine called Perplexity, which my colleague Tae Kim wrote about earlier this year. Funded by Nvidia, Jeff Bezos, Databricks, \n        Shopify\n       CEO Tobi Lütke, and other tech luminaries, Perplexity has a clean search interface, with an option to pay $20 a month for a supercharged ChatGPT-style natural language experience. Chatbots aren’t a perfect replacement for Google searches. ChatGPT and Claude were both trained on data sets that ended in 2022—they lack information about real-time events. They can’t tell you who won the Sixers game or what the weekend weather will be. But that could change—Gemini has current news and sports data—and the utility of chatbots is high enough to replace search for many tasks. It now seems likely that Google is going to lose some query share at the margin. And it’s possible the losses will be material.The enemy within: Maybe the greatest enemy to Google search comes from the company itself. As consumers shift more searches to Gemini, the pressure will grow on the company to replace lost search ad revenue. The answer could be to add transactional capabilities to Gemini and to take a cut of the resultant purchases. CEO Sundar Pichai has said ads will remain a key part of the search experience while the company experiments with new ad formats inside generative AI searches.It’s also possible that Google could get traction with its $20-a-month subscription version of Gemini, which provides access to its most advanced AI model. Still, there is a risk that monetizing chatbots will be more difficult than selling ads against search queries. AI is expensive: Some analysts have estimated that the cost per query for an AI chatbot can be as much as 10 times the cost of a conventional Google search. No doubt those costs will decline over time as volumes increase, but any delta between the two puts more pressure on Alphabet’s margins and amplifies the need for Google to monetize Gemini. Meanwhile, the company has said it will ratchet up capital spending substantially in 2024 as it invests in GPUs, servers, and related infrastructure to handle AI work. For all the worries, not a single Wall Street analyst calls Alphabet stock a Sell. Of the 66 sell-side analysts who follow Alphabet, roughly 80% still have Buy ratings, according to FactSet. There is growing skepticism, though, especially among those 20% of analysts that rate shares at Hold or the equivalent. Alphabet shares fell this past week after a bearish note from Melius Research analyst Ben Reitzes. “While Google may have a moat, let us remind you that search isn’t really recurring,” wrote Reitzes, who rates Alphabet at Hold with a $164 price target. “What has been recurring for decades is the reliability of Google’s interface for ad buyers, its reputation for search quality, and its strong brand. But search is not like a subscription to Microsoft 365, Apple Services, or Amazon Prime.” In short, you can switch to another search engine anytime. And your choices are getting better every day.Write to Eric J. Savitz at eric.savitz@barrons.com"
      },
      {
        "url": "https://www.marketwatch.com/story/microsoft-hasnt-been-worth-this-much-more-than-apple-since-2003-8c2583e0?mod=mw_quote_news",
        "stockcode": "MSFT",
        "content": "Microsoft Corp. continues to pull away from Apple Inc. in terms of market capitalization — so much so that the gap between them is the widest it’s been in over two decades. Based on intraday action, Microsoft \n        MSFT,\n        +0.45%\n       has a $3.063 trillion market cap Friday, while Apple’s \n        AAPL,\n        -0.60%\n       clocks in at $2.754 trillion. If the corresponding stock-market action carries through to the close, that would translate to a $309.4 billion margin, the largest between these two companies since Oct. 21, 2003, according to Dow Jones Market Data. Of course, the picture was much different back in 2003, when the $312.1 billion spread between the two tech players was almost as large as Microsoft’s entire valuation. Microsoft commanded a $320.2 billion market value on Oct. 21, 2003, while Apple’s valuation was only $8.1 billion. See also: Microsoft earnings may have offered a big bullish clue about cloud growthFor context about Apple’s business at the time, its annual filing for 2003 discussed “advanced new digital devices such as the company’s iPod digital music players, personal digital assistants, cellular phones, digital still and movie cameras, CD and DVD players, and other electronic devices.”Apple’s business is of course much more advanced now, but investors haven’t been too excited about it this year, with the stock off about 8% so far in 2024. The company returned to year-over-year revenue growth in its latest quarter after four quarters of declines but suggested revenue could fall again in the ongoing quarter. Some on Wall Street have questioned whether Apple’s innovative ways are waning.The market-cap gap between Apple and Microsoft is especially staggering considering how far ahead Apple was just under a year and a half ago. Apple was worth $719.2 billion more than Microsoft on Oct. 28, 2022, according to Dow Jones Market Data.The decline in Apple shares to start 2024 comes after the stock surged 48% in 2023. Microsoft, on the other hand, has been able to sustain its momentum from last year: Its stock advanced 57% then but is up another 10% so far this year. Microsoft, in the eyes of Wall Street, appears a play on the hot artificial-intelligence market, as the company’s Azure cloud-computing business benefits from growing customer interest in AI workloads. At the same time, Microsoft has been infusing its own software products with AI functions, and the company has invested in OpenAI. Apple has long used AI across its business, including for features like the Siri voice assistant and the iPhone’s photo-recognition capabilities. But the company’s management has kept AI discussion to a minimum on recent earnings calls even as corporate executives elsewhere have rushed to convince Wall Street that they’re plays on the trend. See more (from August 2023): Apple’s Tim Cook explains why he won’t showboat around AI“Our M.O., if you will, has always been to do work and then talk about work and not to get out in front of ourselves,” Chief Executive Tim Cook said on the company’s last earnings call. But he added that Apple had some “things” going on with generative AI “that we’re incredibly excited about that we’ll be talking about later this year.”Opinion: Will Apple create a better AI? Questions abound as Tim Cook hints at what’s to come.Goldman Sachs removed Apple shares from its conviction list Friday, while keeping a buy rating on them. Analyst Mike Ng “continues to believe that the market’s focus on slower product revenue growth masks the strength of the Apple ecosystem and associated revenue durability & visibility,” according to Goldman’s report on the changes to the list."
      }
    ]
  }
]